app/controllers/items_controller.rb

SELECT "items".* FROM "items"  WHERE (price >= '100')
---
	def index
		@items = Item.all

INSERT INTO "items" ("created_at", "description", "name", "price", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-20 09:01:18.176557"], ["description", "good car"], ["name", "car"], ["price", 100.0], ["updated_at", "2014-10-20 09:01:18.176557"], ["weight", 1000.0]]
---
	def create
		@item = Item.create(items_params)

UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = 1  [["description", "good car http://o.aolcdn.com/hss/storage/adam/6e58b30fb96bf0d28d10fa6d290682e7/porsche-exclusive-911t-cab.jpg"], ["updated_at", "2014-10-28 13:18:19.037485"]]
---
	def update
		@item.update_attributes(items_params)

SELECT  "items".* FROM "items"  WHERE "items"."id" = 1  ORDER BY "items"."id" ASC LIMIT 1
---
	def find_item
		@item = Item.find(params[:id])